app/Http/Middleware/LocaleMiddleware.php

select * from `locales`
---
    public function handle($request, Closure $next)
    {
        /*
         * Locale is enabled and allowed to be changed
         */
        if (config('locale.status')) {
            $locales = Locale::get();