app/Http/Controllers/BundlesController.php

select * from `categories` where `status` = 1 and `categories`.`deleted_at` is null
select * from `courses` where (`expire_at` is null or date(`expire_at`) >= '2023-03-09') and `published` = 1 and `featured` = 1 and `courses`.`deleted_at` is null limit 8
select * from `blogs` order by `created_at` desc limit 2
---
    public function all()
    {
        if (request('type') == 'popular') {
            $bundles = Bundle::withoutGlobalScope('filter')->canDisableBundle()->where('published', 1)->where('popular', '=', 1)->orderBy('id', 'desc')->paginate(9);

        } else if (request('type') == 'trending') {
            $bundles = Bundle::withoutGlobalScope('filter')->canDisableBundle()->where('published', 1)->where('trending', '=', 1)->orderBy('id', 'desc')->paginate(9);

        } else if (request('type') == 'featured') {
            $bundles = Bundle::withoutGlobalScope('filter')->canDisableBundle()->where('published', 1)->where('featured', '=', 1)->orderBy('id', 'desc')->paginate(9);

        } else {
            $bundles = Bundle::withoutGlobalScope('filter')->canDisableBundle()->where('published', 1)->orderBy('id', 'desc')->paginate(9);
        }
        $categories = Category::where('status','=',1)->get();

        $purchased_bundles = NULL;
        if (\Auth::check()) {
            $purchased_bundles = Bundle::withoutGlobalScope('filter')->whereHas('students', function ($query) {
                $query->where('id', \Auth::id());
            })
                ->with('courses')
                ->orderBy('id', 'desc')
                ->get();
        }
        $featured_courses = Course::withoutGlobalScope('filter')->canDisableCourse()->where('published', '=', 1)
            ->where('featured', '=', 1)->take(8)->get();

        $recent_news = Blog::orderBy('created_at', 'desc')->take(2)->get();